#include <iostream>
using namespace std;
//map[i][0] : i idx에서의 점수
//map[i][j] : i idx에서 주사위가 j가 나왔을 때 가는 idx
int map[33][6] = {
{0,1,2,3,4,5},
{2,2,3,4,5,6},
{4,3,4,5,6,7},
{6,4,5,6,7,8},
{8,5,6,7,8,9},
{10,20,21,22,28,29},
{12,7,8,9,10,11},
{14,8,9,10,11,12},
{16,9,10,11,12,13},
{18,10,11,12,13,14},
{20,23,24,28,29,30},
{22,12,13,14,15,16},
{24,13,14,15,16,17},
{26,14,15,16,17,18},
{28,15,16,17,18,19},
{30,25,26,27,28,29},
{32,17,18,19,31,32},
{34,18,19,31,32,32},
{36,19,31,32,32,32},
{38,31,32,32,32,32},
{13,21,22,28,29,30},
{16,22,28,29,30,31},
{19,28,29,30,31,32},
{22,24,28,29,30,31},
{24,28,29,30,31,32},
{28,26,27,28,29,30},
{27,27,28,29,30,31},
{26,28,29,30,31,32},
{25,29,30,31,32,32},
{30,30,31,32,32,32},
{35,31,32,32,32,32},
{40,32,32,32,32,32},
{0, 32,32,32,32,32}
};
int pos[4];
int dice[10];
int max(int a, int b) {return a>b?a:b;}
int simul(int order) {
    int ans = 0;
    for (int i=0; i<4; ++i) pos[i] = 0;
    for (int i=0; i<10; ++i) {
        int mal = order & 3;
        order = order >> 2;
        int cur_pos = pos[mal];
        int nxt_pos = map[cur_pos][dice[i]];
        for (int j=0; j<4; ++j) {
            if (nxt_pos != 32 && pos[j] == nxt_pos) return -1;
        }
        pos[mal] = nxt_pos;
        ans += map[pos[mal]][0];
        
    }
    return ans;
}
int main() {
    ios::sync_with_stdio(false);
    for (int i=0; i<10; ++i) {
        cin >> dice[i];
    }
    int ans = 0;
    for (int i=0; i<(1<<20); ++i) {
        ans = max(ans, simul(i));
    }
    cout << ans << endl;
    return 0;
}